fixtures/vcr_cassettes/SulBib_API/POST_/authorship/success/with_sul_author_id/behaves_like_it_creates_new_contributions_and_publications/for_a_new_WoS_publication/adds_new_WoS_publication.yml

---
http_interactions:
- request:
    method: post
    uri: http://search.webofknowledge.com/esti/wokmws/ws/WokSearch
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://woksearch.v3.wokmws.thomsonreuters.com"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><tns:retrieveById><databaseId>WOK</databaseId><uid>WOS:000386326200035</uid><queryLanguage>en</queryLanguage><retrieveParameters><firstRecord>1</firstRecord><count>100</count><option><key>RecordIDs</key><value>On</value></option><option><key>targetNamespace</key><value>http://scientific.thomsonreuters.com/schema/wok5.4/public/FullRecord</value></option></retrieveParameters></tns:retrieveById></soapenv:Body></soapenv:Envelope>
    headers:
      User-Agent:
      - HTTPClient/1.0 (2.8.3, ruby 2.4.1 (2017-03-22))
      Accept:
      - "*/*"
      Date:
      - Sat, 16 Dec 2017 00:40:11 GMT
      Cookie:
      - SID="5FnxGjahz97aooq5YdD"
      Soapaction:
      - ''
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '714'
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - text/xml;charset=UTF-8
      Date:
      - Sat, 16 Dec 2017 00:40:11 GMT
      Server:
      - Apache-Coyote/1.1
      Content-Length:
      - '15762'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:retrieveByIdResponse xmlns:ns2="http://woksearch.v3.wokmws.thomsonreuters.com"><return><queryId>4</queryId><recordsFound>1</recordsFound><recordsSearched>75118135</recordsSearched><optionValue><label>RecordIDs</label><value>WOS:000386326200035</value></optionValue><records>&lt;records xmlns="http://scientific.thomsonreuters.com/schema/wok5.4/public/FullRecord">
        &lt;REC r_id_disclaimer="ResearcherID data provided by Clarivate Analytics">&lt;UID>WOS:000386326200035&lt;/UID>&lt;static_data>&lt;summary>&lt;EWUID>&lt;WUID coll_id="WOS">&lt;/WUID>&lt;edition value="WOS.ISTP">&lt;/edition>&lt;/EWUID>&lt;pub_info sortdate="2016-01-01" pubyear="2016" has_abstract="Y" coverdate="2016" pubtype="Book in series">&lt;page begin="381" end="392" page_count="12">381-392&lt;/page>&lt;/pub_info>&lt;titles count="7">&lt;title type="source">PACIFIC SYMPOSIUM ON BIOCOMPUTING 2016&lt;/title>&lt;title type="series">Biocomputing-Pacific Symposium on Biocomputing&lt;/title>&lt;title type="source_abbrev">BIOCOMPUT-PAC SYM&lt;/title>&lt;title type="abbrev_11">BIOCOMPUT-P&lt;/title>&lt;title type="abbrev_29">BIOCOMPUT-PAC SYMP BIOCOMPUT&lt;/title>&lt;title type="item">SEPARATING THE CAUSES AND CONSEQUENCES IN DISEASE TRANSCRIPTOME&lt;/title>&lt;title type="book_series" translated="N">Biocomputing-Pacific Symposium on Biocomputing&lt;/title>&lt;/titles>&lt;names count="9">&lt;name seq_no="1" role="author" addr_no="1 2" daisng_id="17393789">&lt;display_name>Li, Yong Fuga&lt;/display_name>&lt;full_name>Li, Yong Fuga&lt;/full_name>&lt;wos_standard>Li, YF&lt;/wos_standard>&lt;first_name>Yong Fuga&lt;/first_name>&lt;last_name>Li&lt;/last_name>&lt;/name>&lt;name seq_no="2" role="author" addr_no="3" daisng_id="40757911">&lt;display_name>Xin, Fuxiao&lt;/display_name>&lt;full_name>Xin, Fuxiao&lt;/full_name>&lt;wos_standard>Xin, FX&lt;/wos_standard>&lt;first_name>Fuxiao&lt;/first_name>&lt;last_name>Xin&lt;/last_name>&lt;/name>&lt;name seq_no="3" role="author" reprint="Y" addr_no="1 4" daisng_id="795671">&lt;display_name>Altman, Russ B.&lt;/display_name>&lt;full_name>Altman, Russ B.&lt;/full_name>&lt;wos_standard>Altman, RB&lt;/wos_standard>&lt;first_name>Russ B.&lt;/first_name>&lt;last_name>Altman&lt;/last_name>&lt;email_addr>russ.altman@stanford.edu&lt;/email_addr>&lt;/name>&lt;name seq_no="4" role="book_editor">&lt;display_name>Altman, RB&lt;/display_name>&lt;full_name>Altman, RB&lt;/full_name>&lt;wos_standard>Altman, RB&lt;/wos_standard>&lt;first_name>RB&lt;/first_name>&lt;last_name>Altman&lt;/last_name>&lt;/name>&lt;name seq_no="5" role="book_editor">&lt;display_name&gt;Dunker, AK&lt;/display_name>&lt;full_name>Dunker, AK&lt;/full_name>&lt;wos_standard>Dunker, AK&lt;/wos_standard>&lt;first_name>AK&lt;/first_name>&lt;last_name>Dunker&lt;/last_name>&lt;/name>&lt;name seq_no="6" role="book_editor">&lt;display_name>Hunter, L&lt;/display_name>&lt;full_name>Hunter, L&lt;/full_name>&lt;wos_standard>Hunter, L&lt;/wos_standard>&lt;first_name>L&lt;/first_name>&lt;last_name>Hunter&lt;/last_name>&lt;/name>&lt;name seq_no="7" role="book_editor">&lt;display_name>Ritchie, MD&lt;/display_name>&lt;full_name>Ritchie, MD&lt;/full_name>&lt;wos_standard>Ritchie, MD&lt;/wos_standard>&lt;first_name>MD&lt;/first_name>&lt;last_name>Ritchie&lt;/last_name>&lt;/name>&lt;name seq_no="8" role="book_editor">&lt;display_name>Murray, T&lt;/display_name>&lt;full_name>Murray, T&lt;/full_name>&lt;wos_standard>Murray, T&lt;/wos_standard>&lt;first_name>T&lt;/first_name>&lt;last_name>Murray&lt;/last_name>&lt;/name>&lt;name seq_no="9" role="book_editor">&lt;display_name>Klein, TE&lt;/display_name>&lt;full_name>Klein, TE&lt;/full_name>&lt;wos_standard>Klein, TE&lt;/wos_standard>&lt;first_name>TE&lt;/first_name>&lt;last_name>Klein&lt;/last_name>&lt;/name>&lt;/names>&lt;doctypes count="1">&lt;doctype>Proceedings Paper&lt;/doctype>&lt;/doctypes>&lt;conferences count="1">&lt;conference conf_id="302652">&lt;conf_infos count="1">&lt;conf_info>21st Pacific Symposium on Biocomputing (PSB), JAN 04-08, 2016, HI&lt;/conf_info>&lt;/conf_infos>&lt;conf_titles count="1">&lt;conf_title>21st Pacific Symposium on Biocomputing (PSB)&lt;/conf_title>&lt;/conf_titles>&lt;conf_dates count="1">&lt;conf_date conf_start="20160104" conf_end="20160108">JAN 04-08, 2016&lt;/conf_date>&lt;/conf_dates>&lt;conf_locations count="1">&lt;conf_location>&lt;conf_state>HI&lt;/conf_state>&lt;/conf_location>&lt;/conf_locations>&lt;/conference>&lt;/conferences>&lt;publishers>&lt;publisher>&lt;address_spec addr_no="1">&lt;full_address>PO BOX 128 FARRER RD, SINGAPORE 9128, SINGAPORE&lt;/full_address>&lt;city>SINGAPORE&lt;/city>&lt;/address_spec>&lt;names count="1">&lt;name role="publisher" seq_no="1" addr_no="1">&lt;display_name>WORLD SCIENTIFIC PUBL CO PTE LTD&lt;/display_name>&lt;full_name>WORLD SCIENTIFIC PUBL CO PTE LTD&lt;/full_name>&lt;/name>&lt;/names>&lt;/publisher>&lt;/publishers>&lt;/summary>&lt;fullrecord_metadata>&lt;languages count="1">&lt;language type="primary">English&lt;/language>&lt;/languages>&lt;normalized_languages count="1">&lt;language type="primary">English&lt;/language>&lt;/normalized_languages>&lt;normalized_doctypes count="1">&lt;doctype>Meeting&lt;/doctype>&lt;/normalized_doctypes>&lt;refs count="50">&lt;/refs>&lt;addresses count="4">&lt;address_name>&lt;address_spec addr_no="1">&lt;full_address>Stanford Univ, Dept Bioengn, Stanford, CA 94305 USA&lt;/full_address>&lt;organizations count="2">&lt;organization>Stanford Univ&lt;/organization>&lt;organization pref="Y">Stanford University&lt;/organization>&lt;/organizations>&lt;suborganizations count="1">&lt;suborganization>Dept Bioengn&lt;/suborganization>&lt;/suborganizations>&lt;city>Stanford&lt;/city>&lt;state>CA&lt;/state>&lt;country>USA&lt;/country>&lt;zip location="AP">94305&lt;/zip>&lt;/address_spec>&lt;names count="2">&lt;name seq_no="1" role="author" addr_no="1" daisng_id="17393789">&lt;display_name>Li, Yong Fuga&lt;/display_name>&lt;full_name>Li, Yong Fuga&lt;/full_name>&lt;wos_standard>Li, YF&lt;/wos_standard>&lt;first_name>Yong Fuga&lt;/first_name>&lt;last_name>Li&lt;/last_name>&lt;/name>&lt;name seq_no="3" role="author" reprint="Y" addr_no="1" daisng_id="795671">&lt;display_name>Altman, Russ B.&lt;/display_name>&lt;full_name>Altman, Russ B.&lt;/full_name>&lt;wos_standard>Altman, RB&lt;/wos_standard>&lt;first_name>Russ B.&lt;/first_name>&lt;last_name>Altman&lt;/last_name>&lt;email_addr>russ.altman@stanford.edu&lt;/email_addr>&lt;/name>&lt;/names>&lt;/address_name>&lt;address_name>&lt;address_spec addr_no="2">&lt;full_address>Stanford Univ, Stanford Genome Technol Ctr, Stanford, CA 94305 USA&lt;/full_address>&lt;organizations count="2">&lt;organization>Stanford Univ&lt;/organization>&lt;organization pref="Y">Stanford University&lt;/organization>&lt;/organizations>&lt;suborganizations count="1">&lt;suborganization>Stanford Genome Technol Ctr&lt;/suborganization>&lt;/suborganizations>&lt;city>Stanford&lt;/city>&lt;state>CA&lt;/state>&lt;country>USA&lt;/country>&lt;zip location="AP">94305&lt;/zip>&lt;/address_spec>&lt;names count="1">&lt;name seq_no="1" role="author" addr_no="2" daisng_id="17393789">&lt;display_name>Li, Yong Fuga&lt;/display_name>&lt;full_name>Li, Yong Fuga&lt;/full_name>&lt;wos_standard>Li, YF&lt;/wos_standard>&lt;first_name>Yong Fuga&lt;/first_name>&lt;last_name>Li&lt;/last_name>&lt;/name>&lt;/names>&lt;/address_name>&lt;address_name>&lt;address_spec addr_no="3">&lt;full_address>Stanford Univ, Machine Learning Lab, GE Global Res, Stanford, CA 94305 USA&lt;/full_address>&lt;organizations count="3">&lt;organization>Stanford Univ&lt;/organization>&lt;organization pref="Y">General Electric&lt;/organization>&lt;organization pref="Y">Stanford University&lt;/organization>&lt;/organizations>&lt;suborganizations count="2">&lt;suborganization>Machine Learning Lab&lt;/suborganization>&lt;suborganization>GE Global Res&lt;/suborganization>&lt;/suborganizations>&lt;city>Stanford&lt;/city>&lt;state>CA&lt;/state>&lt;country>USA&lt;/country>&lt;zip location="AP">94305&lt;/zip>&lt;/address_spec>&lt;names count="1">&lt;name seq_no="2" role="author" addr_no="3" daisng_id="40757911">&lt;display_name>Xin, Fuxiao&lt;/display_name>&lt;full_name>Xin, Fuxiao&lt;/full_name>&lt;wos_standard>Xin, FX&lt;/wos_standard>&lt;first_name>Fuxiao&lt;/first_name>&lt;last_name>Xin&lt;/last_name>&lt;/name>&lt;/names>&lt;/address_name>&lt;address_name>&lt;address_spec addr_no="4">&lt;full_address>Stanford Univ, Dept Genet, Stanford, CA 94305 USA&lt;/full_address>&lt;organizations count="2">&lt;organization>Stanford Univ&lt;/organization>&lt;organization pref="Y">Stanford University&lt;/organization>&lt;/organizations>&lt;suborganizations count="1">&lt;suborganization>Dept Genet&lt;/suborganization>&lt;/suborganizations>&lt;city>Stanford&lt;/city>&lt;state>CA&lt;/state>&lt;country>USA&lt;/country>&lt;zip location="AP">94305&lt;/zip>&lt;/address_spec>&lt;names count="1">&lt;name seq_no="3" role="author" reprint="Y" addr_no="4" daisng_id="795671">&lt;display_name>Altman, Russ B.&lt;/display_name>&lt;full_name>Altman, Russ B.&lt;/full_name>&lt;wos_standard>Altman, RB&lt;/wos_standard>&lt;first_name>Russ B.&lt;/first_name>&lt;last_name>Altman&lt;/last_name>&lt;email_addr>russ.altman@stanford.edu&lt;/email_addr>&lt;/name>&lt;/names>&lt;/address_name>&lt;/addresses>&lt;reprint_addresses count="2">&lt;address_name>&lt;address_spec addr_no="1">&lt;full_address>Stanford Univ, Dept Bioengn, Stanford, CA 94305 USA&lt;/full_address>&lt;organizations count="2">&lt;organization>Stanford Univ&lt;/organization>&lt;organization pref="Y">Stanford University&lt;/organization>&lt;/organizations>&lt;suborganizations count="1">&lt;suborganization>Dept Bioengn&lt;/suborganization>&lt;/suborganizations>&lt;city>Stanford&lt;/city>&lt;state>CA&lt;/state>&lt;country>USA&lt;/country>&lt;zip location="AP">94305&lt;/zip>&lt;/address_spec>&lt;names count="1">&lt;name seq_no="1" role="author" reprint="Y" addr_no="1">&lt;display_name>Altman, Russ B.&lt;/display_name>&lt;full_name>Altman, Russ B.&lt;/full_name>&lt;wos_standard>Altman, RB&lt;/wos_standard>&lt;first_name>Russ B.&lt;/first_name>&lt;last_name>Altman&lt;/last_name>&lt;email_addr>russ.altman@stanford.edu&lt;/email_addr>&lt;/name>&lt;/names>&lt;/address_name>&lt;address_name>&lt;address_spec addr_no="2">&lt;full_address>Stanford Univ, Dept Genet, Stanford, CA 94305 USA&lt;/full_address>&lt;organizations count="2">&lt;organization>Stanford Univ&lt;/organization>&lt;organization pref="Y">Stanford University&lt;/organization>&lt;/organizations>&lt;suborganizations count="1">&lt;suborganization>Dept Genet&lt;/suborganization>&lt;/suborganizations>&lt;city>Stanford&lt;/city>&lt;state>CA&lt;/state>&lt;country>USA&lt;/country>&lt;zip location="AP">94305&lt;/zip>&lt;/address_spec>&lt;names count="1">&lt;name seq_no="1" role="author" reprint="Y" addr_no="2">&lt;display_name>Altman, Russ B.&lt;/display_name>&lt;full_name>Altman, Russ B.&lt;/full_name>&lt;wos_standard>Altman, RB&lt;/wos_standard>&lt;first_name>Russ B.&lt;/first_name>&lt;last_name>Altman&lt;/last_name>&lt;email_addr>russ.altman@stanford.edu&lt;/email_addr>&lt;/name>&lt;/names>&lt;/address_name>&lt;/reprint_addresses>&lt;category_info>&lt;headings count="1">&lt;heading>Science &amp;amp; Technology&lt;/heading>&lt;/headings>&lt;subheadings count="2">&lt;subheading>Technology&lt;/subheading>&lt;subheading>Life Sciences &amp;amp; Biomedicine&lt;/subheading>&lt;/subheadings>&lt;subjects count="6">&lt;subject ascatype="traditional" code="EV">Computer Science, Interdisciplinary Applications&lt;/subject>&lt;subject ascatype="traditional" code="IQ">Engineering, Electrical &amp;amp; Electronic&lt;/subject>&lt;subject ascatype="traditional" code="MC">Mathematical &amp;amp; Computational Biology&lt;/subject>&lt;subject ascatype="extended">Computer Science&lt;/subject>&lt;subject ascatype="extended">Engineering&lt;/subject>&lt;subject ascatype="extended">Mathematical &amp;amp; Computational Biology&lt;/subject>&lt;/subjects>&lt;/category_info>&lt;abstracts count="1">&lt;abstract>&lt;abstract_text count="1">&lt;p>The causes of complex diseases are multifactorial and the phenotypes of complex diseases are typically heterogeneous, posting significant challenges for both the experiment design and statistical inference in the study of such diseases. Transcriptome profiling can potentially provide key insights on the pathogenesis of diseases, but the signals from the disease causes and consequences are intertwined, leaving it to speculations what are likely causal. Genome-wide association study on the other hand provides direct evidences on the potential genetic causes of diseases, but it does not provide a comprehensive view of disease pathogenesis, and it has difficulties in detecting the weak signals from individual genes. Here we propose an approach diseaseExPatho that combines transcriptome data, regulome knowledge, and GWAS results if available, for separating the causes and consequences in the disease transcriptome. DiseaseExPatho computationally deconvolutes the expression data into gene expression modules, hierarchically ranks the modules based on regulome using a novel algorithm, and given GWAS data, it directly labels the potential causal gene modules based on their correlations with genome-wide gene-disease associations. Strikingly, we observed that the putative causal modules are not necessarily differentially expressed in disease, while the other modules can show strong differential expression without enrichment of top GWAS variations. On the other hand, we showed that the regulatory network based module ranking prioritized the putative causal modules consistently in 6 diseases, We suggest that the approach is applicable to other common and rare complex diseases to prioritize causal pathways with or without genome-wide association studies.&lt;/p>&lt;/abstract_text>&lt;/abstract>&lt;/abstracts>&lt;/fullrecord_metadata>&lt;item xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="itemType_wos" coll_id="WOS">&lt;ids avail="N">BG0LW&lt;/ids>&lt;bib_id>: 381-392 2016&lt;/bib_id>&lt;bib_pagecount type="Book">592&lt;/bib_pagecount>&lt;keywords_plus count="10">&lt;keyword>INDEPENDENT COMPONENT ANALYSIS&lt;/keyword>&lt;keyword>ROBUST MULTIARRAY ANALYSIS&lt;/keyword>&lt;keyword>FUNCTIONAL GENOMICS&lt;/keyword>&lt;keyword>REGULATORY NETWORKS&lt;/keyword>&lt;keyword>WIDE ASSOCIATION&lt;/keyword>&lt;keyword>GENE DISCOVERY&lt;/keyword>&lt;keyword>DATABASE&lt;/keyword>&lt;keyword>TOOL&lt;/keyword>&lt;keyword>NORMALIZATION&lt;/keyword>&lt;keyword>ALGORITHMS&lt;/keyword>&lt;/keywords_plus>&lt;book_pages>592&lt;/book_pages>&lt;book_notes count="2">&lt;book_note>Figures&lt;/book_note>&lt;book_note>Color plates&lt;/book_note>&lt;/book_notes>&lt;book_desc>&lt;bk_binding>P&lt;/bk_binding>&lt;bk_publisher>WORLD SCIENTIFIC PUBL CO INC, 687 HARTWELL ST, TEANECK, NJ 07666 USA&lt;/bk_publisher>&lt;bk_prepay>Y&lt;/bk_prepay>&lt;/book_desc>&lt;book_desc>&lt;bk_binding>H&lt;/bk_binding>&lt;bk_publisher>WORLD SCIENTIFIC PUBL CO INC, 687 HARTWELL ST, TEANECK, NJ 07666 USA&lt;/bk_publisher>&lt;bk_prepay>Y&lt;/bk_prepay>&lt;/book_desc>&lt;/item>&lt;/static_data>&lt;dynamic_data>&lt;citation_related>&lt;tc_list>&lt;silo_tc coll_id="WOS" local_count="0">&lt;/silo_tc>&lt;/tc_list>&lt;/citation_related>&lt;cluster_related>&lt;identifiers>&lt;identifier type="issn" value="2335-6936">&lt;/identifier>&lt;identifier type="eisbn" value="978-981-4749-40-4">&lt;/identifier>&lt;identifier type="isbn" value="978-981-4749-41-1">&lt;/identifier>&lt;/identifiers>&lt;/cluster_related>&lt;/dynamic_data>&lt;/REC>
        &lt;/records></records></return></ns2:retrieveByIdResponse></soap:Body></soap:Envelope>
    http_version: 
  recorded_at: Sat, 16 Dec 2017 00:40:11 GMT
- request:
    method: post
    uri: https://ws.isiknowledge.com/cps/xrpc
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <request xmlns="http://www.isinet.com/xrpc41" src="app.id=API Demo">
          <fn name="LinksAMR.retrieve">
            <list>
              <map>
                <val name="username">StanfordU_SW</val>
                <val name="password">2@#$StUni</val>
              </map>
              <map>
                <list name="WOS">
                    <val>doi</val>
                    <val>pmid</val>
                </list>
              </map>
              <map>
                  <map name="cite_WOS:000386326200035">
                    <val name="ut">WOS:000386326200035</val>
                  </map>
              </map>
            </list>
          </fn>
        </request>
    headers:
      User-Agent:
      - Faraday v0.13.1
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip,deflate
      Date:
      - Sat, 16 Dec 2017 00:40:11 GMT
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Origin:
      - "*"
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Content-Type:
      - text/xml;charset=UTF-8
      Date:
      - Sat, 16 Dec 2017 00:40:11 GMT
      Platform:
      - CPS 2017.R3.0.9
      Pragma:
      - no-cache
      Server:
      - Apache/2.4.25 (Unix) ESTI-Router/4.9.0.10
      Content-Length:
      - '248'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8" ?>
        <response xmlns="http://www.isinet.com/xrpc41" src="app.id=API Demo">
        <fn name="LinksAMR.retrieve" rc="OK">
        <map>
        <map name="cite_WOS:000386326200035">
        <map name="WOS">
        </map>
        </map>
        </map>
        </fn>
        </response>
    http_version: 
  recorded_at: Sat, 16 Dec 2017 00:40:11 GMT
recorded_with: VCR 4.0.0
